<?php
    define('REGEX_NO_NUMBER','/^[a-zA-Z-ÀÁÂÃÄÅÇÑñÇçÈÉÊËÌÍÎÏÒÓÔÕÖØÙÚÛÜÝàáâãäåçèéêëìíîïðòóôõöøùúûüýÿ\']*$/');
    define('REGEX_LETTER_NUMBER','/^[0-9a-zA-Z-ÀÁÂÃÄÅÇÑñÇçÈÉÊËÌÍÎÏÒÓÔÕÖØÙÚÛÜÝàáâãäåçèéêëìíîïðòóôõöøùúûüýÿ\ ]*$/');
    define('REGEX_LETTER_NUMBER_OPERATOR','/^[0-9a-zA-Z-ÀÁÂÃÄÅÇÑñÇçÈÉÊËÌÍÎÏÒÓÔÕÖØÙÚÛÜÝàáâãäåçèéêëìíîïðòóôõöøùúûüýÿ\ \+]*$/');
    define('REGEX_POLEEMPLOI','/^([0-9]*)[A-Z]/');
    define('REGEX_NUMBER_ONLY','/^[0-9]{1,2}/');
    define('REGEX_EMAIL','/[-0-9a-zA-Z\!\#\$\%\&\'\*\+\-\/\=\?\^\_\`\.\{\|\}\~]+@[-0-9a-zA-Z.+_]+.[a-zA-Z]{2,4}/');
    //define('REGEX_PHONENUMBER_FRENCH','/^[0][0-9]{9}/');
    define('REGEX_PHONENUMBER_INT','/^(?:0|\(?\+33\)?\s?|0033\s?)[1-79](?:[\.\-\s]?\d\d){4}$/');
    //define('REGEX_PHONENUMBER_INT','/^[+][0-9]{11}/');
    define('REGEX_BIRTHDATE_YYYY_MM_DD','/^(?:19|20)[0-9]{2}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-9])|(?:(?!02)(?:0[1-9]|1[0-2])-(?:30))|(?:(?:0[13578]|1[02])-31))/');
    define('REGEX_ZIPCODE_FRENCH','/^(0[1-9]|[1-8][0-9]|9[0-5]|9[78])[0-9]{3}$/');
    define('REGEX_URL','/\b(?:(?:https?|http):\/\/|www\.)(codecademy.com)[-a-z0-9+&@#\/%?=~_|!:,.;]*[-a-z0-9+&@#\/%=~_|]/');
    define('REGEX_PASSWORD_U_L_N','/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?!.*\s).*$/');
    define('REGEX_PASSWORD_U_L_N_SPECIAL_8_MIN','/(?=^.{8,}$)((?=.*\d)|(?=.*\W+))(?![.\n])(?=.*[A-Z])(?=.*[a-z]).*$/');
    define('REGEX_ISBN','/^(?:(?=.{17}$)97[89][ -](?:[0-9]+[ -]){2}[0-9]+[ -][0-9]|97[89][0-9]{10}|(?=.{13}$)(?:[0-9]+[ -]){2}[0-9]+[ -][0-9Xx]|[0-9]{9}[0-9Xx])/');






?>